namespace CSharpForUniversity
{
    internal class Program
    {
        /*
        Варіант 6
        Скласти опис класу для вектора, заданого координатами його кінців в тривимірному просторі. 
        Забезпечити операції складання і віднімання векторів з отриманням нового вектора (суми або різниці), 
        обчислення скалярного твору двох векторів, довжини вектора, косинуса кута між векторами.
        Написати програму, що демонструє всі розроблені елементи класу
        */
        static void Main(string[] args)
        {
            var vector = new Vector3D(3, 4, 5);
            Console.WriteLine(vector);
        }
    }
}